app/controllers/store_controller.rb

INSERT INTO "line_items" ("created_at", "product_id", "quantity", "order_id", "total_price", "updated_at") VALUES('2010-04-10 19:41:15', 2, 1, 1, 28.5, '2010-04-10 19:41:15')
INSERT INTO "orders" ("name", "address", "created_at", "updated_at", "pay_type", "email") VALUES('test', 'test', '2010-04-10 19:41:15', '2010-04-10 19:41:15', 'cheque', 'test')
---
  def save_order
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save